---
type: FabricWireItem
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 7
tags: [revit-api, class]
---

# FabricWireItem

`Autodesk.Revit.DB.Structure.FabricWireItem` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2018 | `public static FabricWireItem Create ( double distance , double wireLength , ElementId wireType , double wireOffset )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Distance | 2017 | `public double Distance { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OffsetAlongWire | 2018 | `public double OffsetAlongWire { get ; set ; }` |
| Property | WireLength | 2017 | `public double WireLength { get ; set ; }` |
| Property | WireType | 2017 | `public ElementId WireType { get ; set ; }` |